players = {
    "name":"",
    "armor" : 10 ,
    'hp': 100,
    'attack': 7,
    'luck': 15,
    'money': 100,
    'inventory': []

}

enemies = [
    {
        'name': 'Улитка горыныч', 
        'hp': 50,
        'attack': 35,
        'script': 'чтобы победить меня тебе надо одолеть 5 волн, в первой волне будут орки, во второй шреки, в третий 3 цунами, в 4 змеи горынычи, финал волна стивы из майнкрафта.',
        'win': 'поздравляю ты победил держи 10 монет',
        'loss': 'ты проиграл держи 1 монету и выбирай нового персонажа.'
    },
    {
        'name': 'Змей Горыныч',
        'hp': 25,
        'attack': 25,
        'script': 'вам надо угадать мою загадку или тебя ждет смерть',
        'win': 'Ты  отгадал мою загадку иди дальше путник.',
        'loss': 'ты не отгадал мою загадку то ты сразишься со мной тебе меня не одалеть ты напрасно делаешь вид что знаешь все наперед.'
    },

    {
        'name': 'Jawa Skript',
        'hp': 200,
        'attack': 50,
        'script': 'ты не когда меня не осилишь, я самый сложный язык мира.',
        'win': 'ты победил теперь ты главный босс или ...',
        'loss': 'ты проиграл начинай с начала но "" уже не доступен'
    },
    {
        'name': 'Jawa Skript 3',
        'hp': 500,
        'attack': 75,
        'script': 'как ты посмел придти ко мне я тебя уничтожу',
        'win': 'ты одолел меня твоя награда миска риска и +1000 социал рейтинга продолжение следует ...',
        'loss': 'хахаха ты проиграл твой прогресс будет сброшен, а игра начнется с начала'
    }
]
items = {
    '1': {
        'name': 'меч начала',
        'price': 0
    },
    '2': {
        'name': 'меч после начала',
        'price': 1000
     },
    '3': {
        'name': 'алмазный топор',
        'price': 7000
     },
    '4': {
        'name': 'алмазный меч',
        'price': 5000
     },
    '5': {
        'name': 'код войны',
        'price': 10000
     }



     
}